# Programming Lesson and Exercises - ORG<span class="tocSkip"></span>

These programming lessons do not require prior programming experience.

The goal is to teach you the use of _Python 3_ and the _Jupyter Notebook_ software
in the context of _Data Analytics_.

<div class="alert-info alert" role="alert-info">While you read this notebook,
execute all code cells in linear order
from the beginning</div>


# Introduction to this template notebook

* This is a **personal** notebook.
* Make sure you work in a **copy** of `...-template.ipynb`,
**renamed** to `...-yourIDnr.ipynb`,
where `yourIDnr` is your TU/e identification number.

<div class="alert alert-danger" role="danger">
<h3>Integrity</h3>
<ul>
    <li>In this course you must act according to the rules of the TU/e code of scientific conduct.</li>
    <li>All the exercises and the graded assignments are to be executed individually and independently.</li>
    <li>You must not copy from the Internet, your friends, books... If you represent other people's work as your own, then that constitutes fraud and will be reported to the Examination Committee.</li>
    <li>Making your work available to others (complicity) also constitutes fraud.</li>
</ul>
</div>

You are expected to work with Python code in this notebook.

The locations where you should write your solutions can be recognized by
**marker lines**,
which look like this:

>`#//`
>    `BEGIN_TODO [Label]` `Description` `(n points)`
>
>`#//`
>    `END_TODO [Label]`

<div class="alert alert-warning" role="alert">Do NOT modify or delete these marker lines.  Keep them as they are.<br/>
<br/>
NEVER write code <i>outside</i> the marked blocks.
Such code cannot be evaluated.
</div>

Proceed in this notebook as follows:
* **Read** the text.
* **Fill in** your solutions between `BEGIN_TODO` and `END_TODO` marker lines.
* **Run** _all_ code cells (also the ones _without_ your code),
    _in linear order_ from the first code cell.

**Personalize your notebook**:
1. Copy the following three lines of code:

  ```python
  AUTHOR_NAME = 'Your Full Name'
  AUTHOR_ID_NR = '1234567'
  AUTHOR_DATE = 'YYYY-MM-DD'  # when notebook was first modified, e.g. '2019-02-26'
  ```

1. Paste them between the marker lines in the next code cell.
1. Fill in your _full name_, _identification number_, and the current _date_ as strings between quotes.
1. Run the code cell by putting the cursor there and typing **Control-Enter**.

In [40]:
#// BEGIN_TODO [Author] Name, Id.nr., Date, as strings (1 point)

AUTHOR_NAME = 'Kyra Moviat'
AUTHOR_ID_NR = '1349171'
AUTHOR_DATE = '2019-02-28'

#// END_TODO [Author]

AUTHOR_NAME, AUTHOR_ID_NR, AUTHOR_DATE

('Kyra Moviat', '1349171', '2019-02-28')

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#1.-SQLite-Basics" data-toc-modified-id="1.-SQLite-Basics-1"><span class="section">1.</span> SQLite Basics</a></span><ul class="toc-item"><li><span><a href="#Learning-Objectives-of-This-Section" data-toc-modified-id="Learning-Objectives-of-This-Section-1.1">Learning Objectives of This Section</a></span></li><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1.2">Introduction</a></span></li><li><span><a href="#Step-1.-Connect-to-database" data-toc-modified-id="Step-1.-Connect-to-database-1.3">Step 1. Connect to database</a></span></li><li><span><a href="#Step-2.-Operate-on-database" data-toc-modified-id="Step-2.-Operate-on-database-1.4">Step 2. Operate on database</a></span></li><li><span><a href="#Step-3.-Commit-changes-to-database" data-toc-modified-id="Step-3.-Commit-changes-to-database-1.5">Step 3. Commit changes to database</a></span></li><li><span><a href="#Step-4.-Close-connection-to-database" data-toc-modified-id="Step-4.-Close-connection-to-database-1.6">Step 4. Close connection to database</a></span></li></ul></li><li><span><a href="#2.-SQL---Structured-Query-Language" data-toc-modified-id="2.-SQL---Structured-Query-Language-2"><span class="section">2.</span> SQL - Structured Query Language</a></span><ul class="toc-item"><li><span><a href="#Select" data-toc-modified-id="Select-2.1">Select</a></span></li><li><span><a href="#Update" data-toc-modified-id="Update-2.2">Update</a></span></li></ul></li><li><span><a href="#3.-Cleaning" data-toc-modified-id="3.-Cleaning-3"><span class="section">3.</span> Cleaning</a></span><ul class="toc-item"><li><span><a href="#df.astype():-convert-to-given-type" data-toc-modified-id="df.astype():-convert-to-given-type-3.1"><code>df.astype()</code>: convert to given type</a></span></li><li><span><a href="#pd.to_numeric():-convert-to-numeric" data-toc-modified-id="pd.to_numeric():-convert-to-numeric-3.2"><code>pd.to_numeric()</code>: convert to numeric</a></span></li><li><span><a href="#ts.unique():-find-all-unique-values" data-toc-modified-id="ts.unique():-find-all-unique-values-3.3"><code>ts.unique()</code>: find all unique values</a></span></li><li><span><a href="#df.duplicated():-find-duplicates" data-toc-modified-id="df.duplicated():-find-duplicates-3.4"><code>df.duplicated()</code>: find duplicates</a></span></li><li><span><a href="#df.drop_duplicates():-remove-duplicates" data-toc-modified-id="df.drop_duplicates():-remove-duplicates-3.5"><code>df.drop_duplicates()</code>: remove duplicates</a></span></li><li><span><a href="#df.dropna()-to-remove-rows-with-missing-values" data-toc-modified-id="df.dropna()-to-remove-rows-with-missing-values-3.6"><code>df.dropna()</code> to remove rows with missing values</a></span></li><li><span><a href="#df.fillna()-to-replace-missing-values" data-toc-modified-id="df.fillna()-to-replace-missing-values-3.7"><code>df.fillna()</code> to replace missing values</a></span></li><li><span><a href="#ts.str.strip()-to-strip-characters-from-begin/end-of-strings" data-toc-modified-id="ts.str.strip()-to-strip-characters-from-begin/end-of-strings-3.8"><code>ts.str.strip()</code> to strip characters from begin/end of strings</a></span></li></ul></li><li><span><a href="#4.-Exercises" data-toc-modified-id="4.-Exercises-4"><span class="section">4.</span> Exercises</a></span></li><li><span><a href="#(End-of-Notebook)" data-toc-modified-id="(End-of-Notebook)-5">(End of Notebook)</a></span></li></ul></div>

# <span class="section">1.</span> SQLite Basics

## Learning Objectives of This Section

After this lesson, you should

* know how to work with SQLite databases through Pandas data frames;
* know how to work with SQLite databases through cursor objects;
* know how to create, update, and delete tables using Python and its `sqlite3` library.

## Introduction

So far, we have dealt with data given as a _single table_,
typically stored in a CSV file and operated on in a Pandas `DataFrame`.
Often, however, the use of a single table leads to unnecessary duplication of data
and difficulties in data processing.

For example,
consider an experiment where we collect data from various patients.
We have data pertaining to each patient:
name, date of birth, and daily weight and temperature measurements.
How to _organize_ that data and store it?
This is important for the _data collection_ process and subsequent
_data analysis_ process.

You could try to put it in one table,
with one row per patient, and columns for name, date of birth, and every day:

| Name | Date of Birth | Day 1 Weight | Day 1 Temperature | Day 2 Weight | Day 2 Temperature | ... |
| :--- | :------------ | -----------: | ----------------: | -----------: | ----------------: | --: |
| A | 1950-01-01 | 60.0 | 37.8 | 59.8 | 38.1 | ... |
| B | 1947-07-15 | 84.3 | 39.2 | 85.0 | 38.5 | ... |
| ... | ... | ... | ... | ... | ... | ... |

The number of columns would grow, and could differ per patient.

You could try to put it in one table,
with one row per patient per day,
and columns for name, date of birth, day, weight, and temperature,
repeating values that stay the same (name and date of birth):

| Name | Date of Birth | Day | Weight | Temperature |
| :--- | :------------ | --: | -----: | ----------: |
| A | 1950-01-01 | 1 | 60.0 | 37.8 |
| B | 1947-07-15 | 1 | 84.3 | 39.2 |
| A | 1950-01-01 | 2 | 59.8 | 38.1 |
| B | 1947-07-15 | 2 | 84.3 | 39.2 |
| ... | ... | ... | ... | ... |

In this approach, some data (necessarily) gets duplicated.

Also, note that patients may not be uniquely identified by name and date of birth.
In the first table, their measurements would still be kept apart.
But in the second table, this starts to be problematic.

Using multiple, related tables is a better approach.
In this case, two tables could be used:

**Patient data**

| ID | Name | Date of Birth |
| -: | :--- | :------------ |
| 13 | A | 1950-01-01 |
| 72 | B | 1947-07-15 |
| ... | ... | ... |

**Measurement data**

| ID | Day | Weight | Temperature |
| -: | --: | -----: | ----------: |
| 13 |  1 | 60.0 | 37.8 |
| 72 |  1 | 84.3 | 39.2 |
| 13 |  2 | 59.8 | 38.1 |
| 72 |  2 | 84.3 | 39.2 |
| ... | ... | ... | ... |

The additional column `ID` relates the two tables,
and helps to keep apart patients with the same name and date of birth.

We assume that you have a basic understanding of how a _relational database_ is organized:

* a collection of (named, related) _tables_, where
* each table consists of a collection of _rows_, where
* each row contains one _value_ per _column_,
* where all values in a column belong to a prescribed _type_.

In this lesson we will use SQL,
a standardized language to work with _relational databases_.
SQL stands for **Structured Query Language**.
It has its own rules for syntax, semantics, and pragmatics.
We'll cover some of these rules later.

We use **SQLite** as _SQL database engine_
(it knows SQL, though not all of it).
Note that SQLite is a separate piece of open-source software,
that is installed as part of Anaconda.
Many programs make use of SQLite internally.

### Loading the libraries

To show examples, we load some Data Analytics libraries first:

In [41]:
import numpy as np  # import auxiliary library, typical idiom
import pandas as pd  # import the Pandas library, typical idiom

Next, we load **`sqlite3`**, a Python library to work with _SQLite_ databases:

In [42]:
import sqlite3

### Common steps in working with SQLite databases

Typically, the following sequence of steps takes place,
when working with an SQLite database.

1. Connect to the database (residing in a file).
2. Operate on the database:

    * execute queries, to retrieve selected values;
    * create, update, or delete rows/values in a table;
    * create, alter (by adding or deleting columns), or delete tables.
    
3. Commit changes to the database, or roll them back.
4. Close the connection to the database.

Steps 2 and 3 can be repeated as desired.

When working with an SQL database,
operations are expressed as **SQL statements**.
SQL statements are executed via a so-called **cursor** object,
that also captures and delivers any results of the SQL statement.

### SQLite and Pandas

The Pandas library offers two functions to work with SQL databases:

* **`pd.read_sql_query()`** : return the query result as a `DataFrame`
* **`df.to_sql()`** : write `DataFrame df` as table to a database

We prefer to use these functions whenever possible.
That way, you don't have to work via cursor objects.

## Step 1. Connect to database

In order to work with a database,
a _connection_ to that database needs to be established.

An SQLite database is stored in a (binary) file in the file system.

You connect to it via

* **`sqlite3.connect(file_name)`**

This function returns a **connection object**,
that you will need in subsequent operations.
It is typically assigned to a variable named `conn`:

In [43]:
conn = sqlite3.connect('countries.db')  # connect to database in file countries.db

If the database file did not yet exist,
it will be created, starting out with an empty database.

## Step 2. Operate on database

Operations on a database can be classified as

* **Create** : a new table
* **Read** : from one or more existing tables
* **Update** : modify a table, by adding, updating, or deleting rows
* **Delete** : an existing table

### Via Pandas data frames

It is easiest to work with an SQLite database
via the Pandas library in terms of complete data frames.

So, lets first get a data frame.
We will grab the country data that we have used before:

In [44]:
country_data = pd.read_csv('datasets/country-data.csv', na_values=[''], keep_default_na=False)
country_data.head()
country_data.name.values

array(['Andorra', 'United Arab Emirates', 'Afghanistan',
       'Antigua and Barbuda', 'Anguilla', 'Albania', 'Armenia', 'Angola',
       'Antarctica', 'Argentina', 'American Samoa', 'Austria', 'Australia',
       'Aruba', 'Aland Islands', 'Azerbaijan', 'Bosnia and Herzegovina',
       'Barbados', 'Bangladesh', 'Belgium', 'Burkina Faso', 'Bulgaria',
       'Bahrain', 'Burundi', 'Benin', 'Saint Barthelemy', 'Bermuda',
       'Brunei', 'Bolivia', 'Bonaire, Saint Eustatius and Saba ', 'Brazil',
       'Bahamas', 'Bhutan', 'Bouvet Island', 'Botswana', 'Belarus',
       'Belize', 'Canada', 'Cocos Islands',
       'Democratic Republic of the Congo', 'Central African Republic',
       'Republic of the Congo', 'Switzerland', 'Ivory Coast',
       'Cook Islands', 'Chile', 'Cameroon', 'China', 'Colombia',
       'Costa Rica', 'Cuba', 'Cape Verde', 'Curacao', 'Christmas Island',
       'Cyprus', 'Czechia', 'Germany', 'Djibouti', 'Denmark', 'Dominica',
       'Dominican Republic', 'Algeria', 'Ecuador', 'Estonia', 'Egypt',
       'Western Sahara', 'Eritrea', 'Spain', 'Ethiopia', 'Finland', 'Fiji',
       'Falkland Islands', 'Micronesia', 'Faroe Islands', 'France',
       'Gabon', 'United Kingdom', 'Grenada', 'Georgia', 'French Guiana',
       'Guernsey', 'Ghana', 'Gibraltar', 'Greenland', 'Gambia', 'Guinea',
       'Guadeloupe', 'Equatorial Guinea', 'Greece',
       'South Georgia and the South Sandwich Islands', 'Guatemala', 'Guam',
       'Guinea-Bissau', 'Guyana', 'Hong Kong',
       'Heard Island and McDonald Islands', 'Honduras', 'Croatia', 'Haiti',
       'Hungary', 'Indonesia', 'Ireland', 'Israel', 'Isle of Man', 'India',
       'British Indian Ocean Territory', 'Iraq', 'Iran', 'Iceland',
       'Italy', 'Jersey', 'Jamaica', 'Jordan', 'Japan', 'Kenya',
       'Kyrgyzstan', 'Cambodia', 'Kiribati', 'Comoros',
       'Saint Kitts and Nevis', 'North Korea', 'South Korea', 'Kosovo',
       'Kuwait', 'Cayman Islands', 'Kazakhstan', 'Laos', 'Lebanon',
       'Saint Lucia', 'Liechtenstein', 'Sri Lanka', 'Liberia', 'Lesotho',
       'Lithuania', 'Luxembourg', 'Latvia', 'Libya', 'Morocco', 'Monaco',
       'Moldova', 'Montenegro', 'Saint Martin', 'Madagascar',
       'Marshall Islands', 'Macedonia', 'Mali', 'Myanmar', 'Mongolia',
       'Macao', 'Northern Mariana Islands', 'Martinique', 'Mauritania',
       'Montserrat', 'Malta', 'Mauritius', 'Maldives', 'Malawi', 'Mexico',
       'Malaysia', 'Mozambique', 'Namibia', 'New Caledonia', 'Niger',
       'Norfolk Island', 'Nigeria', 'Nicaragua', 'Netherlands', 'Norway',
       'Nepal', 'Nauru', 'Niue', 'New Zealand', 'Oman', 'Panama', 'Peru',
       'French Polynesia', 'Papua New Guinea', 'Philippines', 'Pakistan',
       'Poland', 'Saint Pierre and Miquelon', 'Pitcairn', 'Puerto Rico',
       'Palestinian Territory', 'Portugal', 'Palau', 'Paraguay', 'Qatar',
       'Reunion', 'Romania', 'Serbia', 'Russia', 'Rwanda', 'Saudi Arabia',
       'Solomon Islands', 'Seychelles', 'Sudan', 'South Sudan', 'Sweden',
       'Singapore', 'Saint Helena', 'Slovenia', 'Svalbard and Jan Mayen',
       'Slovakia', 'Sierra Leone', 'San Marino', 'Senegal', 'Somalia',
       'Suriname', 'Sao Tome and Principe', 'El Salvador', 'Sint Maarten',
       'Syria', 'Swaziland', 'Turks and Caicos Islands', 'Chad',
       'French Southern Territories', 'Togo', 'Thailand', 'Tajikistan',
       'Tokelau', 'East Timor', 'Turkmenistan', 'Tunisia', 'Tonga',
       'Turkey', 'Trinidad and Tobago', 'Tuvalu', 'Taiwan', 'Tanzania',
       'Ukraine', 'Uganda', 'United States Minor Outlying Islands',
       'United States', 'Uruguay', 'Uzbekistan', 'Vatican',
       'Saint Vincent and the Grenadines', 'Venezuela',
       'British Virgin Islands', 'U.S. Virgin Islands', 'Vietnam',
       'Vanuatu', 'Wallis and Futuna', 'Samoa', 'Yemen', 'Mayotte',
       'South Africa', 'Zambia', 'Zimbabwe', 'Netherlands Antilles'], dtype=object)

Here is how you write that data frame as a new table named `'countries'`
to the database that we just opened using the `DataFrame` method **`to_sql()`**:

In [45]:
country_data.to_sql('countries', conn, if_exists='replace', index=False)

Just some quick notes about the arguments of **`to_sql()`**:

* **`country_data`** is the data frame to put in the database
* **`'countries'`** is the name of the table to create, replace, or append to.
* **`conn`** is a previously opened connection to an SQLite database.
* **`if_exists='replace'`** will replace an existing table by that same name.  
    Default is **`if_exists='fail'`**,
    which will refuse to overwrite an existing table by the given name.  
    Another variant is **`if_exists='append'`**
    to insert all the rows from the data frame into the table.
* **`index=False`** will suppress writing of the data frame's index as a separate column.  
    Default is **`index=True`**,
    which will write the index as a separate column.
    
> **NOTE**: `to_sql()` automatically commits the changes to the database.  
> So, no additional `commit()` is needed.

Now that we have a table in our database, we can **query** it.

A SQL query is stored in a Python string.
Here is an example:

In [46]:
query = '''
    SELECT name, capital, area, population
    FROM countries
    WHERE area < 1000 AND population > 200000
    ORDER BY population desc;
'''

This query

* selects all rows from the table `countries`
* that have an area less than 1000 and a population over 200000
* showing only the columns `'name'`, `'capital'`, `'area'`, and `'population`',
* sorted on population in descending order.

It can be executed with the Pandas function **`pd.read_sql_query()`**,
which returns the result as a `DataFrame`:

In [47]:
pd.read_sql_query(query, conn)

                   name     capital   area  population
0             Singapore   Singapore  692.7     4701069
1               Bahrain      Manama  665.0      738004
2                 Macao       Macao  254.0      449198
3                 Malta    Valletta  316.0      403000
4              Maldives        Male  300.0      395650
5  Netherlands Antilles  Willemstad  960.0      300000
6              Barbados  Bridgetown  431.0      285653

### Exercise <span class="exercise">1.a</span>

Execute the following query to select the name, population, and area of all
countries with an area larger than one million square km:

```
SELECT name, area, population
FROM countries
WHERE area > 1000000
```

Execute the query on the open database, retrieving the result as a Pandas `DataFrame`. Use the already defined connection `conn`.

Assign the result to variable `result_1a`.

In [48]:
#// BEGIN_TODO [ORG_1a] Execute pre-defined query (1 point)
query1a = ''' 
SELECT name, area, population
FROM countries
WHERE area > 1000000
'''
result_1a = pd.read_sql_query(query1a, conn)

#// END_TODO [ORG_1a]

result_1a

                                name        area  population
0                             Angola   1246700.0    13068161
1                         Antarctica  14000000.0           0
2                          Argentina   2766890.0    41343201
3                          Australia   7686850.0    21515754
4                            Bolivia   1098580.0     9947418
5                             Brazil   8511965.0   201103330
6                             Canada   9984670.0    33679000
7   Democratic Republic of the Congo   2345410.0    70916439
8                              China   9596960.0  1330044000
9                           Colombia   1138910.0    47790000
10                           Algeria   2381740.0    34586184
11                             Egypt   1001450.0    80471869
12                          Ethiopia   1127127.0    88013491
13                         Greenland   2166086.0       56375
14                         Indonesia   1919440.0   242968342
15                             India   3287590.0  1173108018
16                              Iran   1648000.0    76923300
17                        Kazakhstan   2717300.0    15340000
18                             Libya   1759540.0     6461454
19                              Mali   1240000.0    13796354
20                          Mongolia   1565000.0     3086918
21                        Mauritania   1030700.0     3205060
22                            Mexico   1972550.0   112468855
23                             Niger   1267000.0    15878271
24                              Peru   1285220.0    29907003
25                            Russia  17100000.0   140702000
26                      Saudi Arabia   1960582.0    25731776
27                             Sudan   1861484.0    35000000
28                              Chad   1284000.0    10543464
29                     United States   9629091.0   310232863
30                      South Africa   1219912.0    49000000

### Via cursor objects

Instead of writing an entire data frame as a table,
or reading the entire result of a query into a Pandas `DataFrame`,
you can also work via a so-called **cursor** object.
For operations on a database that are not queries
(that do not return a table),
you _must_ work with a cursor object.

This approach involves the following steps:

1. Create a cursor object.
1. Execute the SQL statement.
1. Optionally, process the result through the cursor object.

The query above is executed as follows using a cursor object.
Since there are no changes, no commit is needed.

In [49]:
cur = conn.cursor()  # 1. Create cursor object.
cur.execute(query)  # 2. Execute SQL statement
cur.fetchall()  # 3. Inspect the result (all rows)

[('Singapore', 'Singapore', 692.7, 4701069),
 ('Bahrain', 'Manama', 665.0, 738004),
 ('Macao', 'Macao', 254.0, 449198),
 ('Malta', 'Valletta', 316.0, 403000),
 ('Maldives', 'Male', 300.0, 395650),
 ('Netherlands Antilles', 'Willemstad', 960.0, 300000),
 ('Barbados', 'Bridgetown', 431.0, 285653)]

We recommend

* to use **`pd.read_sql_query()`** for _queries_ (SELECT statements),
so that the result is conveniently available as a Pandas `DataFrame`, and
* to use **`execute()`** for other (non-SELECT) SQL statements.

### Exercise <span class="exercise">1.b</span>

Execute a query to select the name and population of European countries with a population larger than 60 million, ordered in descending order on population:

```
SELECT name, population
FROM countries
WHERE continent = "EU" AND population > 60000000
ORDER BY population DESC;
```

Execute the query via the cursor object `cur` defined above.

Assign the result to variable `result_1b`.

In [50]:
#// BEGIN_TODO [ORG_1b] Execute pre-defined query with cursor (1 point)

query1b = '''
SELECT name, population
FROM countries
WHERE continent = "EU" AND population > 60000000
ORDER BY population DESC;
'''

cur = conn.cursor()
cur.execute(query1b)
result_1b = cur.fetchall()

#// END_TODO [ORG_1b]

result_1b

[('Russia', 140702000),
 ('Germany', 81802257),
 ('France', 64768389),
 ('United Kingdom', 62348447),
 ('Italy', 60340328)]

<span id="commit_changes"></span>

## Step 3. Commit changes to database

If changes have been made to the database through _cursor objects_
then you need to **commit** them in order to persist in the database file,
and become visible to other users of that same database.
Alternatively, you can decide to **rollback** the changes.

> **NOTE**: Changes made through `DataFrame.to_sql()` are committed automatically.  
> It is not possible to rollback in that case.

Let's make a change, via the cursor object that we already have.

First, we inspect the population for the Netherlands:

In [51]:
get_pop_NL = 'SELECT name, population FROM countries WHERE name = "Netherlands";'
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    16645000

Next, we define an SQL statement to update the population of the Netherlands
to that of 12 Dec 2017
([source](http://www.worldometers.info/world-population/population-by-country/)),
and execute it.

In [52]:
update_pop_NL = '''
    UPDATE countries
    SET population = 17035938
    WHERE name = "Netherlands";
'''
cur.execute(update_pop_NL);

Let's check the update:

In [53]:
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    17035938

### Rollback via `rollback()`

We could decide to **rollback** (cancel) all _pending_ changes,
via **`conn.rollback()`**:

In [54]:
conn.rollback()

Let's check again:

In [55]:
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    16645000

So, the change was undone.
Now let's make the change again:

In [56]:
cur.execute(update_pop_NL);

### Commit via `commit()`

Finally, we **commit** all _pending_ changes via **`conn.commit()`**,
to make it visible to other users of that database:

In [57]:
conn.commit()

After the changes have been committed, they cannot be rolled back (i.e. **`conn.rollback()`** will have no effect):

In [58]:
conn.rollback()
pd.read_sql_query(get_pop_NL, conn)

          name  population
0  Netherlands    17035938

### Exercise <span class="exercise">1.c</span>

Execute a query to update the country database and set the population for Antarctica to one thousand:

```
UPDATE countries
SET population = 1000
WHERE name = "Antarctica";
```

Execute the query via the cursor object `cur` defined earlier.

In [59]:
#// BEGIN_TODO [ORG_1c] Execute an UPDATE query (1 point)

query1c = '''
UPDATE countries
SET population = 1000
WHERE name = "Antarctica";
'''
cur.execute(query1c);

#// END_TODO [ORG_1c]

### Exercise <span class="exercise">1.d</span>

Commit the preceding change to the database.

In [60]:
#// BEGIN_TODO [ORG_1d] Commit changes (1 point)

conn.commit()

#// END_TODO [ORG_1d]

## Step 4. Close connection to database

Once you no longer want to work with the database,
you can (and are encouraged to) close the connection to it:

In [61]:
conn.close()

# <span class="section">2.</span> SQL - Structured Query Language

Also see: [W3 Schools - SQL Tutorial](https://www.w3schools.com/sql/).

The _Structured Query Language_ consists of several sublanguages:

* **DDL** - Data Definition Language (**CREATE**, **ALTER**, **ADD**, **DROP**)
* **DML** - Data Manipulation Language (**SELECT**, **INSERT**, **UPDATE**, **DELETE**)
* **TCL** - Transaction Control Language (**COMMIT**, **ROLLBACK**)
* **DCL** - Data Control Language (dealing with permissions)

In these lessons,
the Data Manipulation Language is most important, and in particular
its **SELECT** statement that _queries_ a database, in order to retrieve selected values.

> **NOTE**: There are many dialects of SQL.
> We use the _SQLite_ dialect, and try to stay close to the _ANSI standard_.

General rules:

* SQL is _not_ case sensitive (`SELECT` and `select` are treated the same way).
* SQL statements are always terminated by a semicolon ('**`;`**').
* To write an identifier that contains spaces or that is the same as a keyword,
    enclose it in **double quotes**.
* SQL uses **single quotes** to enclose string literals.

Before we continue with practicing SQL queries, let us reestablish a connection to the data base, since we have closed it above:

In [62]:
conn = sqlite3.connect('countries.db')  # connect to database in file countries.db

## Select

The SQL **SELECT** statement retrieves values from a database and
presents the result as a (temporary) table organized in rows and columns.

The SELECT statement has a number of required and optional clauses:

| Clause | Type | Remarks |
| :----- | :--: | :------ |
| `SELECT` _`expr1, expr2, ...`_ | Required | `SELECT *` selects all columns; `SELECT DISTINCT ...` |
| `FROM` _`table1, table2, ...`_ | Required | |
| `... JOIN` _`table`_ `ON` _`condition`_ | Optional | `...` can be `INNER`, `LEFT`, `CROSS` |
| `WHERE` _`condition`_ | Optional | Filter on boolean condition before grouping |
| `GROUP BY` _`column1, column2, ...`_ | Optional | |
| `HAVING` _`condition`_ | Optional | Filter on boolean condition after grouping |
| `ORDER BY` _`column1, column2, ...`_ | Optional | Append `DESC` for descending order |
| `LIMIT` _`number`_ | Optional | Report only first given number of rows |

Numeric expressions _`expr1`_ etc. can contain

* _column names_; must be disambiguated by prepending _table name_: `table1.column1`
* aliases for renaming column/table names: e.g. `table1.column1 AS 'some name'` to rename `table1.column1` to `'some name'` (aliases exist only for the duration of the query)
* operators: +, -, *, /, %
* functions: MIN, MAX, COUNT, SUM, AVG (these aggregate when `GROUP BY` is used)

Here is an example query using `GROUP BY` to obtain an overview of

* all continents, with for each continent
* the number of countries on it
* the total population
* the maximum population over its countries
* the total area
* the maximum area over its countries

sorted in descending order on number countries:

In [63]:
query = '''
    SELECT continent, count(name), sum(population), max(population), sum(area), max(area)
    FROM countries
    GROUP BY continent
    ORDER BY count(name) DESC;
'''
pd.read_sql_query(query, conn)

,continent,count(name),sum(population),max(population),sum(area),max(area)
0,AF,58,1016879730,154000000,30360296.00,2381740.0
1,EU,53,739531963,140702000,23079944.09,17100000.0
2,AS,52,4130586341,1330044000,31603228.70,9596960.0
3,NM,42,540105043,310232863,24512514.00,9984670.0
4,OC,27,36066049,21515754,8523505.90,7686850.0
5,SM,14,400143568,201103330,17818508.00,8511965.0
6,AN,5,1170,1000,14012193.00,14000000.0

### Logical operators

Boolean conditions can contain

* _column names_
* comparison operators: =, <>, <, >, <=, >=
* boolean operators: NOT, AND, OR
* pattern matching operator (to match string values against a pattern with wildcards): LIKE
    * e.g. condition `... WHERE name LIKE "Nether%"` will select rows containing a string starting with `Nether` in the `name` column

> **NOTE**: SQLite does not support `RIGHT` and `OUTER` joins.

### Exercise <span class="exercise">2.a</span>

Define a query to select the name, capital, population, and area of all
countries with an area larger than one million square km and the population is less than ten million, ordered in ascending order on area.

Execute the query on the open database, retrieving the result as a Pandas `DataFrame`. Use the already defined connection `conn`.

Assign the query to variable `query_2a`, and the result to variable `result_2a`.

In [64]:
#// BEGIN_TODO [ORG_2a] Define and execute a query (1 point)

#  SELECT continent, count(name), sum(population), max(population), sum(area), max(area)
#     FROM countries
#     GROUP BY continent
#     ORDER BY count(name) DESC;
# WHERE area < 1000 AND population > 200000
query_2a = '''
SELECT name, capital, population, area
FROM countries
WHERE area > 100000000 AND population < 10000000
ORDER BY area DESC;
'''

result_2a = pd.read_sql_query(query_2a, conn)

#// END_TODO [ORG_2a]

print(query_2a)
print(result_2a)

SELECT name, capital, population, area
FROM countries
WHERE area > 100000000 AND population < 10000000
ORDER BY area DESC;

Empty DataFrame
Columns: [name, capital, population, area]
Index: []

### Joining tables

Let's first add the continent names as a new table:

In [65]:
continents = pd.DataFrame(
    ['Africa',
     'Antarctica',
     'Asia',
     'Europe',
     'North America',
     'Oceania',
     'South America',
    ],
    index=['AF', 'AN', 'AS', 'EU', 'NM', 'OC', 'SM'],
    columns=['name']
)
continents.to_sql('continents', conn, if_exists='replace')
pd.read_sql_query('SELECT * FROM continents;', conn)

  index           name
0    AF         Africa
1    AN     Antarctica
2    AS           Asia
3    EU         Europe
4    NM  North America
5    OC        Oceania
6    SM  South America

Now, let's **join** data from the two tables

* `countries` and
* `continents`,

in such a way that each row of `continents` will also show the full name of the continent
for that country.

Note that the column `'continent'` in `countries` uses the exact same encoding for continents
as the column '`index`' of `continents`.
It serves as the **primary key** in `continents`.

We want to keep all rows of `countries`, and copy in the name from `continent`.

In [66]:
query = '''
    SELECT countries.name, capital, continents.name AS continent, population
    FROM countries, continents
    WHERE countries.continent = continents."index" AND population > 10000000
    ORDER BY population DESC
    LIMIT 10;
'''
pd.read_sql_query(query, conn)

            name     capital      continent  population
0          China     Beijing           Asia  1330044000
1          India   New Delhi           Asia  1173108018
2  United States  Washington  North America   310232863
3      Indonesia     Jakarta           Asia   242968342
4         Brazil    Brasilia  South America   201103330
5       Pakistan   Islamabad           Asia   184404791
6     Bangladesh       Dhaka           Asia   156118464
7        Nigeria       Abuja         Africa   154000000
8         Russia      Moscow         Europe   140702000
9          Japan       Tokyo           Asia   127288000

> **NOTES**
> * The column name `name` appears in both tables `countries` and `continents`.  
>     Therefore, we need to prefix it with the table name to disambiguate it.
> * In the result, we want the column with continents to be labeled '`continent`'.  
>     Therefore, we use the _alias_ `as continent`.
> * The column name `index` in table `continents` conflicts with the SQL keyword `INDEX`.  
>     Therefore, we need to double-quote it.

### Exercise <span class="exercise">2.b</span>

Execute a query to compute the total population per continent. The result should contain two columns: `'continent name'` (containing full names of the continents) and `'total population'`.

Assign the query to variable `query_2b`, and the result to variable `result_2b`.

In [67]:
#// BEGIN_TODO [ORG_2b] Population per continent (1 point)

#   SELECT countries.name, capital, continents.name AS continent, population
#     FROM countries, continents
#     WHERE countries.continent = continents."index" AND population > 10000000
#     ORDER BY population DESC
#     LIMIT 10;
#     SELECT continent, count(name), sum(population), max(population), sum(area), max(area)
query_2b = '''
SELECT continents.name AS 'continent name', sum(population) AS 'total population'
FROM countries, continents
WHERE countries.continent = continents."index"
GROUP BY continent
'''
result_2b = pd.read_sql_query(query_2b, conn)
#// END_TODO [ORG_2b]

print(query_2b)
print(result_2b)

SELECT continents.name AS 'continent name', sum(population) AS 'total population'
FROM countries, continents
WHERE countries.continent = continents."index"
GROUP BY continent

  continent name  total population
0         Africa        1016879730
1     Antarctica              1170
2           Asia        4130586341
3         Europe         739531963
4  North America         540105043
5        Oceania          36066049
6  South America         400143568

### Subqueries, or nested queries

The result of one `SELECT` query can be combined with another `SELECT` query.

For instance, `SELECT` queries can be combined by 

* **`UNION`** to obtain the union of the `SELECT` query results
* **`INTERSECT`** to obtain the intersection of the `SELECT` query results
* **`EXCEPT`** to obtain the rows in the first result without those occurring the second result

In some cases, the same result can be obtained by using **`AND`**, **`OR`**, and **`AND NOT`**
in the `WHERE` clause.

We give one example for `EXCEPT` that cannot simply be expressed using `AND NOT`.

* First, we define and execute a query to select continents
    that have countries whose name starts with an 'E'.
* Second, we define and execute a query to select continents
    that have countries whose area exceeds ten million square km.
* Third, we define and execute a query to select continents
    that have countries whose name starts with an 'E'
    but that do _not_ have countries whose area exceeds ten million square km.

In [68]:
query_E = '''
    SELECT continent
    FROM countries
    WHERE name LIKE \"E%\"
'''
pd.read_sql_query(query_E, conn)

  continent
0        SM
1        EU
2        AF
3        AF
4        AF
5        AF
6        NM
7        OC

In [69]:
query_L = '''
    SELECT continent
    FROM countries
    WHERE area > 10000000
'''
pd.read_sql_query(query_L, conn)

  continent
0        AN
1        EU

In [70]:
query_E_except_L = query_E + '''
    except
''' + query_L
pd.read_sql_query(query_E_except_L, conn)

  continent
0        AF
1        NM
2        OC
3        SM

### Exercise <span class="exercise">2.c</span>

Execute a query to select those continents that

* have countries whose name ends in 'd', and
* do _not_ have countries whose population exceeds one hundred million.

Assign the query to variable `query_2c`, and the result to variable `result_2c`.

In [71]:
#// BEGIN_TODO [ORG_2c] Find the continents (1 point)

query_D = '''SELECT continent
FROM countries
WHERE name LIKE \"%d\"'''

query_M = '''SELECT continent
FROM countries
WHERE population > 100000000'''

query_2c = query_D + '''
    except
''' + query_M

result_2c = pd.read_sql_query(query_2c, conn)

#// END_TODO [ORG_2c]

print(query_2c)
print(result_2c)

SELECT continent
FROM countries
WHERE name LIKE "%d"
    except
SELECT continent
FROM countries
WHERE population > 100000000
  continent
0        AN
1        OC

## Update

| Clause | Type | Remark |
| :----- | :--: | :----- |
| `UPDATE` _`table`_ | Required | |
| `SET` _`column1`_ `=` _`expr1`_ `,` _`column2`_ `=` _`expr2`_ `, ...` | Required | |
| `WHERE` _`condition`_ | Optional | |
| `ORDER BY` _`column1, column2, ...`_ | Optional | Append `DESC` for descending order |
| `LIMIT` _`number`_ | Optional | Update only first given number of rows |

For an example, see [above](#commit_changes).

### Exercise <span class="exercise">2.d</span>

Execute a query to change the population of all countries ending with 'land' to 0.

Assign the query to variable `query_2d`.

Hint: you may need to create a new cursor object for the reestablished connection to the data base.

In [72]:
#// BEGIN_TODO [ORG_2d] Mass emigration (1 point)

# query1c = '''
# UPDATE countries
# SET population = 1000
# WHERE name = "Antarctica";
# '''ERE name LIKE \"%D\"'''


# curb = conn.cursor()
# curb.execute(query1b)
# result_1b = curb.fetchall()


query_2d = '''UPDATE countries
SET population = 0
WHERE name LIKE \"%land\"
'''

curd = conn.cursor()
curd.execute(query_2d)

#// END_TODO [ORG_2d]

### Exercise <span class="exercise">2.e</span>

Execute a query to check whether the desired changes have been applied.

Assign the query to variable `query_2e`, and the result to variable `result_2e`.

In [73]:
#// BEGIN_TODO [ORG_2e] Check the change (1 point)

query_2e = '''SELECT name, population
FROM countries
WHERE name LIKE \"%land\"'''

result_2e = pd.read_sql_query(query_2e, conn)
#// END_TODO [ORG_2e]
print(query_2e)
print(result_2e)

SELECT name, population
FROM countries
WHERE name LIKE "%land"
                name  population
0      Bouvet Island           0
1        Switzerland           0
2   Christmas Island           0
3            Finland           0
4          Greenland           0
5            Ireland           0
6            Iceland           0
7     Norfolk Island           0
8        New Zealand           0
9             Poland           0
10         Swaziland           0
11          Thailand           0

### Exercise <span class="exercise">2.f</span>

Undo the change from the previous exercise.

In [74]:
#// BEGIN_TODO [ORG_2f] Rollback (1 point)

conn.rollback()

#// END_TODO [ORG_2f]

### Exercise <span class="exercise">2.g</span>

Execute query `query_2e` again to check whether the changes have been undone.

Assign the result to variable `result_2g`.

In [75]:
#// BEGIN_TODO [ORG_2g] Check the rollback (1 point)

result_2g = pd.read_sql_query(query_2e, conn)

#// END_TODO [ORG_2g]
print(result_2g)

                name  population
0      Bouvet Island           0
1        Switzerland     7581000
2   Christmas Island        1500
3            Finland     5244000
4          Greenland       56375
5            Ireland     4622917
6            Iceland      308910
7     Norfolk Island        1828
8        New Zealand     4252277
9             Poland    38500000
10         Swaziland     1354051
11          Thailand    67089500

Now we close the connection.

In [76]:
conn.close()

# <span class="section">3.</span> Cleaning

**Raw data** is often not in a form where it can easily be processed.
There can be all kinds of smaller or bigger issues with data.

* extra spaces at the begin and/or end of a string
* missing values
* duplicates
* inconsistencies

The process of preparing data for further processing is called **data cleaning**. In this section, we deal with a few common issues.

The following Pandas functions for data frames and series are relevant.

Let `df` be a `DataFrame` and `ts` be a `Series` object.
Note that `pd` stands for the Pandas library itself.

For the examples, we use `country_data`.

## `df.astype()`: convert to given type

With **`df.astype()`** you convert it to a given type.
The `.dtypes` attribute of a data frame contains the column types:

In [77]:
country_data.dtypes

name           object
alpha_3        object
tld            object
continent      object
capital        object
area          float64
population      int64
dtype: object

We can see that columns `'name'`, ... , `'capital'` are of type `object` (which is also used for columns containing strings), `'area'` contains floating point numbers and `'population'` contains integers. We can convert all columns in a data frame to strings:

In [78]:
country_data_as_str = country_data.astype(str)
country_data_as_str.dtypes

name          object
alpha_3       object
tld           object
continent     object
capital       object
area          object
population    object
dtype: object

We can also convert the type of particular columns by supplying a dictionary as argument to `astype()`:

In [79]:
population_as_str = country_data.astype({'population': str})
population_as_str.dtypes

name           object
alpha_3        object
tld            object
continent      object
capital        object
area          float64
population     object
dtype: object

### Exercise <span class="exercise">3.a</span>

Change the type of the area to `int` and assign the resulting data frame to `area_as_int`.

In [80]:
#// BEGIN_TODO [ORG_3a] Area as int (1 point)

area_as_int = country_data.astype({'area': int})

#// END_TODO [ORG_3a]
area_as_int.dtypes

name          object
alpha_3       object
tld           object
continent     object
capital       object
area           int32
population     int64
dtype: object

##  `pd.to_numeric()`: convert to numeric

With **`pd.to_numeric()`** you can convert an argument to a numeric type. A suitable numeric type (e.g. `int` or `float`) will be chosen.
The argument can be a _list_ or _Series_.

In [81]:
pd.to_numeric(country_data_as_str['population']).head()

0       84000
1     4975593
2    29121286
3       86754
4       13254
Name: population, dtype: int64

In [82]:
pd.to_numeric(country_data_as_str['area']).head()

0       468.0
1     82880.0
2    647500.0
3       443.0
4       102.0
Name: area, dtype: float64

## `ts.unique()`: find all unique values

With `ts.unique()` you obtain an array in which each item of the series appears once.
The order in the array is in the order of appearance in the series object.

In [83]:
country_data['capital'].unique()

array(['Andorra la Vella', 'Abu Dhabi', 'Kabul', "St. John's",
       'The Valley', 'Tirana', 'Yerevan', 'Luanda', nan, 'Buenos Aires',
       'Pago Pago', 'Vienna', 'Canberra', 'Oranjestad', 'Mariehamn',
       'Baku', 'Sarajevo', 'Bridgetown', 'Dhaka', 'Brussels',
       'Ouagadougou', 'Sofia', 'Manama', 'Bujumbura', 'Porto-Novo',
       'Gustavia', 'Hamilton', 'Bandar Seri Begawan', 'Sucre', 'Brasilia',
       'Nassau', 'Thimphu', 'Gaborone', 'Minsk', 'Belmopan', 'Ottawa',
       'West Island', 'Kinshasa', 'Bangui', 'Brazzaville', 'Bern',
       'Yamoussoukro', 'Avarua', 'Santiago', 'Yaounde', 'Beijing',
       'Bogota', 'San Jose', 'Havana', 'Praia', ' Willemstad',
       'Flying Fish Cove', 'Nicosia', 'Prague', 'Berlin', 'Djibouti',
       'Copenhagen', 'Roseau', 'Santo Domingo', 'Algiers', 'Quito',
       'Tallinn', 'Cairo', 'El-Aaiun', 'Asmara', 'Madrid', 'Addis Ababa',
       'Helsinki', 'Suva', 'Stanley', 'Palikir', 'Torshavn', 'Paris',
       'Libreville', 'London', "St. George's", 'Tbilisi', 'Cayenne',
       'St Peter Port', 'Accra', 'Gibraltar', 'Nuuk', 'Banjul', 'Conakry',
       'Basse-Terre', 'Malabo', 'Athens', 'Grytviken', 'Guatemala City',
       'Hagatna', 'Bissau', 'Georgetown', 'Hong Kong', 'Tegucigalpa',
       'Zagreb', 'Port-au-Prince', 'Budapest', 'Jakarta', 'Dublin',
       'Jerusalem', 'Douglas', 'New Delhi', 'Diego Garcia', 'Baghdad',
       'Tehran', 'Reykjavik', 'Rome', 'Saint Helier', 'Kingston', 'Amman',
       'Tokyo', 'Nairobi', 'Bishkek', 'Phnom Penh', 'Tarawa', 'Moroni',
       'Basseterre', 'Pyongyang', 'Seoul', 'Pristina', 'Kuwait City',
       'George Town', 'Astana', 'Vientiane', 'Beirut', 'Castries', 'Vaduz',
       'Colombo', 'Monrovia', 'Maseru', 'Vilnius', 'Luxembourg', 'Riga',
       'Tripoli', 'Rabat', 'Monaco', 'Chisinau', 'Podgorica', 'Marigot',
       'Antananarivo', 'Majuro', 'Skopje', 'Bamako', 'Nay Pyi Taw',
       'Ulan Bator', 'Macao', 'Saipan', 'Fort-de-France', 'Nouakchott',
       'Plymouth', 'Valletta', 'Port Louis', 'Male', 'Lilongwe',
       'Mexico City', 'Kuala Lumpur', 'Maputo', 'Windhoek', 'Noumea',
       'Niamey', 'Abuja', 'Managua', 'Amsterdam', 'Oslo', 'Kathmandu',
       'Yaren', 'Alofi', 'Wellington', 'Muscat', 'Panama City', 'Lima',
       'Papeete', 'Port Moresby', 'Manila', 'Islamabad', 'Warsaw',
       'Saint-Pierre', 'Adamstown', 'San Juan', 'East Jerusalem', 'Lisbon',
       'Melekeok', 'Asuncion', 'Doha', 'Saint-Denis', 'Bucharest',
       'Belgrade', 'Moscow', 'Kigali', 'Riyadh', 'Honiara', 'Victoria',
       'Khartoum', 'Juba', 'Stockholm', 'Singapore', 'Jamestown',
       'Ljubljana', 'Longyearbyen', 'Bratislava', 'Freetown', 'San Marino',
       'Dakar', 'Mogadishu', 'Paramaribo', 'Sao Tome', 'San Salvador',
       'Philipsburg', 'Damascus', 'Mbabane', 'Cockburn Town', "N'Djamena",
       'Port-aux-Francais', 'Lome', 'Bangkok', 'Dushanbe', 'Dili',
       'Ashgabat', 'Tunis', "Nuku'alofa", 'Ankara', 'Port of Spain',
       'Funafuti', 'Taipei', 'Dodoma', 'Kiev', 'Kampala', 'Washington',
       'Montevideo', 'Tashkent', 'Vatican City', 'Kingstown', 'Caracas',
       'Road Town', 'Charlotte Amalie', 'Hanoi', 'Port Vila', 'Mata Utu',
       'Apia', 'Sanaa', 'Mamoudzou', 'Pretoria', 'Lusaka', 'Harare',
       'Willemstad'], dtype=object)

### Exercise <span class="exercise">3.b</span>

Find all unique continent names in the `country_data` data frame and assign the result to `unique_continents`.

In [84]:
#// BEGIN_TODO [ORG_3b] Unique continents (1 point)

unique_continents = country_data['continent'].unique()

#// END_TODO [ORG_3b]
unique_continents

array(['EU', 'AS', 'NM', 'AF', 'AN', 'SM', 'OC'], dtype=object)

## `df.duplicated()`: find duplicates

With **`df.duplicated()`** you obtain a _boolean mask_
indicating which rows appear more than once.
With the argument **`subset=`** you can restrict the search for duplicates
to specific columns
(either a single column or a list of columns).

In [85]:
bm_dup_capital = country_data.duplicated(subset='capital')
country_data[bm_dup_capital]

,name,alpha_3,tld,continent,capital,area,population
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NM,NaN,328.0,18012
33,Bouvet Island,BVT,.bv,AN,NaN,49.0,0
95,Heard Island and McDonald Islands,HMD,.hm,AN,NaN,412.0,0
163,Norfolk Island,NFK,.nf,OC,Kingston,34.6,1828
220,Tokelau,TKL,.tk,OC,NaN,10.0,1466
232,United States Minor Outlying Islands,UMI,.um,OC,NaN,0.0,0

There is an extra argument `keep`:

* **`keep='first'`** (default): Mark duplicates as `True` _except for the first occurrence_.
* **`keep='last'`** : Mark duplicates as `True` _except for the last occurrence_.
* **`keep=False`**`: Mark all duplicates as `True`.

In [86]:
bm_dup_capital_all = country_data.duplicated(subset='capital', keep=False)
country_data[bm_dup_capital_all]

,name,alpha_3,tld,continent,capital,area,population
8,Antarctica,ATA,.aq,AN,NaN,14000000.0,0
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NM,NaN,328.0,18012
33,Bouvet Island,BVT,.bv,AN,NaN,49.0,0
95,Heard Island and McDonald Islands,HMD,.hm,AN,NaN,412.0,0
111,Jamaica,JAM,.jm,NM,Kingston,10991.0,2847232
163,Norfolk Island,NFK,.nf,OC,Kingston,34.6,1828
220,Tokelau,TKL,.tk,OC,NaN,10.0,1466
232,United States Minor Outlying Islands,UMI,.um,OC,NaN,0.0,0

### Exercise <span class="exercise">3.c</span>

Some countries in `country_data` share the same `'tld'`. Find the list of `'tld'`s that are shared by more than one country and assign it to `duplicate_tld`.

In [114]:
#// BEGIN_TODO [ORG_3c] Duplicated data (1 point)

duplicate_tld_bool = country_data.duplicated(subset='tld', keep=False)
duplicate_tld= country_data[duplicate_tld_bool]['tld']
#duplicate_tld.astype(array)
#// END_TODO [ORG_3c]

duplicate_tld

25     .gp
86     .gp
122    NaN
141    .gp
197    NaN
Name: tld, dtype: object

## `df.drop_duplicates()`: remove duplicates

With **`df.drop_duplicates()`** you can remove duplicated rows.
With the argument **`subset=`** you can restrict the search for duplicates to specific columns (either a single column or a list of columns).

In [88]:
country_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 7 columns):
name          251 non-null object
alpha_3       251 non-null object
tld           249 non-null object
continent     251 non-null object
capital       245 non-null object
area          251 non-null float64
population    251 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 13.8+ KB

In [89]:
country_data.drop_duplicates(subset='capital').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 245 entries, 0 to 250
Data columns (total 7 columns):
name          245 non-null object
alpha_3       245 non-null object
tld           243 non-null object
continent     245 non-null object
capital       244 non-null object
area          245 non-null float64
population    245 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.3+ KB

There is an extra argument `keep`:

* **`keep='first'`** (default): Drop duplicates _except for the first occurrence_.
* **`keep='last'`** : Drop duplicates _except for the last occurrence_.
* **`keep=False`**: Drop all duplicates.

### Exercise <span class="exercise">3.d</span>

Drop from the `country_data` data frame all countries which share the same tld and continent with another country. Assign the resulting data frame to `dropped_dup_tld`.

In [90]:
#// BEGIN_TODO [ORG_3d] Drop duplicated data (1 point)

dropped_dup_tld = country_data.drop_duplicates(subset='tld')

#// END_TODO [ORG_3d]

dropped_dup_tld.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 248 entries, 0 to 250
Data columns (total 7 columns):
name          248 non-null object
alpha_3       248 non-null object
tld           247 non-null object
continent     248 non-null object
capital       242 non-null object
area          248 non-null float64
population    248 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.5+ KB

## `df.dropna()` to remove rows with missing values

With **`df.dropna()`** you can remove rows with *missing values*
(_Not-Available_ (NA) and _Not-a-Number_ (NaN)) in a data frame or series object.

With the argument **`how=`** you can indicate whether rows with at least one missing value or with all values missing are dropped:

* **`how='any'`** (default): if any value is missing, drop that row
* **`how='all'`**: if all values are missing, drop that row

In [91]:
country_data_dropna = country_data.dropna()
country_data_dropna.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 243 entries, 0 to 250
Data columns (total 7 columns):
name          243 non-null object
alpha_3       243 non-null object
tld           243 non-null object
continent     243 non-null object
capital       243 non-null object
area          243 non-null float64
population    243 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.2+ KB

### Exercise <span class="exercise">3.e</span>

Drop rows in `country_data` with missing values in the `'tld'` column. Assign the resulting data frame to `dropped_na_tld`.

Hint: look up the documentation of `dropna()` (e.g. via Shift-Tab-Tab)

In [92]:
#// BEGIN_TODO [ORG_3e] Drop missing data (1 point)

dropped_na_tld = country_data.dropna(subset=['tld'])

#// END_TODO [ORG_3e]

dropped_na_tld.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 250
Data columns (total 7 columns):
name          249 non-null object
alpha_3       249 non-null object
tld           249 non-null object
continent     249 non-null object
capital       243 non-null object
area          249 non-null float64
population    249 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.6+ KB

## `df.fillna()` to replace missing values

With **`df.fillna()`** or **`ts.fillna()`**
you can replace *missing values* (_Not-Available_ (NA) and _Not-a-Number_ (NaN))
in a data frame or series object.

As always, note that this returns a new copy with the filled object.

In [93]:
country_data_filled = country_data['capital'].fillna(value='Unknown')
country_data_filled[country_data_filled.duplicated(keep=False)]

8       Unknown
29      Unknown
33      Unknown
95      Unknown
111    Kingston
163    Kingston
220     Unknown
232     Unknown
Name: capital, dtype: object

You can replace missing values in particular columns by providing a dictionary for the first argument, specifying which value to use for which column.

In [94]:
country_data_filled = country_data.fillna({'capital': 'Unknown'})
country_data_filled

,name,alpha_3,tld,continent,capital,area,population
0,Andorra,AND,.ad,EU,Andorra la Vella,468.00,84000
1,United Arab Emirates,ARE,.ae,AS,Abu Dhabi,82880.00,4975593
2,Afghanistan,AFG,.af,AS,Kabul,647500.00,29121286
3,Antigua and Barbuda,ATG,.ag,NM,St. John's,443.00,86754
4,Anguilla,AIA,.ai,NM,The Valley,102.00,13254
5,Albania,ALB,.al,EU,Tirana,28748.00,2986952
6,Armenia,ARM,.am,AS,Yerevan,29800.00,2968000
7,Angola,AGO,.ao,AF,Luanda,1246700.00,13068161
8,Antarctica,ATA,.aq,AN,Unknown,14000000.00,0
9,Argentina,ARG,.ar,SM,Buenos Aires,2766890.00,41343201
10,American Samoa,ASM,.as,OC,Pago Pago,199.00,57881
11,Austria,AUT,.at,EU,Vienna,83858.00,8205000
12,Australia,AUS,.au,OC,Canberra,7686850.00,21515754
13,Aruba,ABW,.aw,NM,Oranjestad,193.00,71566
14,Aland Islands,ALA,.ax,EU,Mariehamn,1580.00,26711
15,Azerbaijan,AZE,.az,AS,Baku,86600.00,8303512
16,Bosnia and Herzegovina,BIH,.ba,EU,Sarajevo,51129.00,4590000
17,Barbados,BRB,.bb,NM,Bridgetown,431.00,285653
18,Bangladesh,BGD,.bd,AS,Dhaka,144000.00,156118464
19,Belgium,BEL,.be,EU,Brussels,30510.00,10403000
20,Burkina Faso,BFA,.bf,AF,Ouagadougou,274200.00,16241811
21,Bulgaria,BGR,.bg,EU,Sofia,110910.00,7148785
22,Bahrain,BHR,.bh,AS,Manama,665.00,738004
23,Burundi,BDI,.bi,AF,Bujumbura,27830.00,9863117
24,Benin,BEN,.bj,AF,Porto-Novo,112620.00,9056010
25,Saint Barthelemy,BLM,.gp,NM,Gustavia,21.00,8450
26,Bermuda,BMU,.bm,NM,Hamilton,53.00,65365
27,Brunei,BRN,.bn,AS,Bandar Seri Begawan,5770.00,395027
28,Bolivia,BOL,.bo,SM,Sucre,1098580.00,9947418
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NM,Unknown,328.00,18012
...,...,...,...,...,...,...,...
221,East Timor,TLS,.tl,OC,Dili,15007.00,1154625
222,Turkmenistan,TKM,.tm,AS,Ashgabat,488100.00,4940916
223,Tunisia,TUN,.tn,AF,Tunis,163610.00,10589025
224,Tonga,TON,.to,OC,Nuku'alofa,748.00,122580
225,Turkey,TUR,.tr,AS,Ankara,780580.00,77804122
226,Trinidad and Tobago,TTO,.tt,NM,Port of Spain,5128.00,1228691
227,Tuvalu,TUV,.tv,OC,Funafuti,26.00,10472
228,Taiwan,TWN,.tw,AS,Taipei,35980.00,22894384
229,Tanzania,TZA,.tz,AF,Dodoma,945087.00,41892895
230,Ukraine,UKR,.ua,EU,Kiev,603700.00,45415596
231,Uganda,UGA,.ug,AF,Kampala,236040.00,33398682
232,United States Minor Outlying Islands,UMI,.um,OC,Unknown,0.00,0
233,United States,USA,.us,NM,Washington,9629091.00,310232863
234,Uruguay,URY,.uy,SM,Montevideo,176220.00,3477000
235,Uzbekistan,UZB,.uz,AS,Tashkent,447400.00,27865738
236,Vatican,VAT,.va,EU,Vatican City,0.44,921
237,Saint Vincent and the Grenadines,VCT,.vc,NM,Kingstown,389.00,104217
238,Venezuela,VEN,.ve,SM,Caracas,912050.00,27223228
239,British Virgin Islands,VGB,.vg,NM,Road Town,153.00,21730
240,U.S. Virgin Islands,VIR,.vi,NM,Charlotte Amalie,352.00,108708
241,Vietnam,VNM,.vn,AS,Hanoi,329560.00,89571130
242,Vanuatu,VUT,.vu,OC,Port Vila,12200.00,221552
243,Wallis and Futuna,WLF,.wf,OC,Mata Utu,274.00,16025
244,Samoa,WSM,.ws,OC,Apia,2944.00,192001
245,Yemen,YEM,.ye,AS,Sanaa,527970.00,23495361
246,Mayotte,MYT,.yt,AF,Mamoudzou,374.00,159042
247,South Africa,ZAF,.za,AF,Pretoria,1219912.00,49000000
248,Zambia,ZMB,.zm,AF,Lusaka,752614.00,13460305
249,Zimbabwe,ZWE,.zw,AF,Harare,390580.00,13061000
250,Netherlands Antilles,ANT,.an,NM,Willemstad,960.00,300000

### Exercise <span class="exercise">3.f</span>

Fill the missing values in the `'tld'` column of the `country_data` data frame with `'Missing'`.

Assign the resulting data frame to `filled_tld`.

In [95]:
#// BEGIN_TODO [ORG_3f] Fill missing data (1 point)

filled_tld = country_data.fillna({'tld': 'Missing'})
#// END_TODO [ORG_3f]

filled_tld.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 7 columns):
name          251 non-null object
alpha_3       251 non-null object
tld           251 non-null object
continent     251 non-null object
capital       245 non-null object
area          251 non-null float64
population    251 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 13.8+ KB

## `ts.str.strip()` to strip characters from begin/end of strings

With **`ts.str.strip()`** you can remove characters from the beginning and end of all strings in a `Series` object.

Without argument, it strips all leading and trailing **whitespace**.

Here we strip all trailing and leading zeros from the area that was converted to a string
in an earlier example.

In [96]:
country_data_as_str['area'].str.strip('0')

0           468.
1         82880.
2        647500.
3           443.
4           102.
5         28748.
6         29800.
7       1246700.
8      14000000.
9       2766890.
10          199.
11        83858.
12      7686850.
13          193.
14         1580.
15        86600.
16        51129.
17          431.
18       144000.
19        30510.
20       274200.
21       110910.
22          665.
23        27830.
24       112620.
25           21.
26           53.
27         5770.
28      1098580.
29          328.
         ...
221       15007.
222      488100.
223      163610.
224         748.
225      780580.
226        5128.
227          26.
228       35980.
229      945087.
230      603700.
231      236040.
232            .
233     9629091.
234      176220.
235      447400.
236          .44
237         389.
238      912050.
239         153.
240         352.
241      329560.
242       12200.
243         274.
244        2944.
245      527970.
246         374.
247     1219912.
248      752614.
249      390580.
250         960.
Name: area, Length: 251, dtype: object

### Exercise <span class="exercise">3.g</span>

Remove the character `'s'` from the beginning and end of all the country names in `country_data`. Assign the resulting series to `stripped_names`.

In [97]:
#// BEGIN_TODO [ORG_3g] Strip the 's' (1 point)

stripped_names = country_data_as_str['name'].str.strip('s')

#// END_TODO [ORG_3g]

stripped_names

0                                  Andorra
1                      United Arab Emirate
2                              Afghanistan
3                      Antigua and Barbuda
4                                 Anguilla
5                                  Albania
6                                  Armenia
7                                   Angola
8                               Antarctica
9                                Argentina
10                          American Samoa
11                                 Austria
12                               Australia
13                                   Aruba
14                            Aland Island
15                              Azerbaijan
16                  Bosnia and Herzegovina
17                                 Barbado
18                              Bangladesh
19                                 Belgium
20                            Burkina Faso
21                                Bulgaria
22                                 Bahrain
23                                 Burundi
24                                   Benin
25                        Saint Barthelemy
26                                 Bermuda
27                                  Brunei
28                                 Bolivia
29      Bonaire, Saint Eustatius and Saba
                      ...
221                             East Timor
222                           Turkmenistan
223                                Tunisia
224                                  Tonga
225                                 Turkey
226                    Trinidad and Tobago
227                                 Tuvalu
228                                 Taiwan
229                               Tanzania
230                                Ukraine
231                                 Uganda
232    United States Minor Outlying Island
233                           United State
234                                Uruguay
235                             Uzbekistan
236                                Vatican
237        Saint Vincent and the Grenadine
238                              Venezuela
239                  British Virgin Island
240                     U.S. Virgin Island
241                                Vietnam
242                                Vanuatu
243                      Wallis and Futuna
244                                  Samoa
245                                  Yemen
246                                Mayotte
247                           South Africa
248                                 Zambia
249                               Zimbabwe
250                    Netherlands Antille
Name: name, Length: 251, dtype: object

# <span class="section">4.</span> Exercises

In the following exercises we will analyze the data from the mouse experiment that many of you have contributed to.

### Exercise <span class="exercise">4.a</span>

Read the data from `'datasets/paths_props.csv'` into a data frame and assign it `df_props`.

In [98]:
#// BEGIN_TODO [ORG_4a] Read the data (1 point)

df_props = pd.read_csv('datasets/paths_props.csv')

#// END_TODO [ORG_4a]

df_props.head()

,user,trial,use_tue_laptop,mouse_speed,mouse_accuracy,right_handed,input_method,major,target_x,target_y,target_radius,delay
0,1226,5,1,1.0,1.0,1,0,Industrial Engineering,-84,-84,6,2.136719
1,1226,6,1,1.0,1.0,1,0,Industrial Engineering,0,190,6,3.540913
2,1226,7,1,1.0,1.0,1,0,Industrial Engineering,-158,-158,6,3.688381
3,1226,8,1,1.0,1.0,1,0,Industrial Engineering,81,-81,3,2.823134
4,1226,9,1,1.0,1.0,1,0,Industrial Engineering,-157,157,9,3.690253

Each row describes a single trial, i.e. one movement from the center to the target. The meaning of the columns is the following:

- `'user'`: The id of the user that recorded this trial.
- `'trial'`: The trial number. Trial numbers are local to each user.
- `'use_tue_laptop'`: 1 means a TU/e laptop was used during this trial, 0 means a different laptop was used
- `'mouse_speed'`, `'mouse_accuracy'`: 1 means the user confirmed this mouse setting, 0 or `NaN` means the user did not confirm this mouse setting (e.g. a non-TU/e laptop was used)
- `'right_handed'`: 1 means user writes with their right hand, 0 means user writes with their left hand
- `'input_method'`: 0 means a trackpad, 1 means a mouse
- `'target_x'`, `'target_y'`: the screen coordinates in pixels of the blue target, relative to the red dot in the center
- `'target_radius'`: radius of the blue target in pixels
- `'delay'`: delay in seconds between the start of the trial (i.e. the moment that the mouse was placed on the red dot) and the moment that the blue target was shown
- `'major'`: the major of the user

As you can see, there is a lot of redundancy in the data. We will reorganize the data into two tables: one describing the user settings (which do not change), and one describing the individual trials. In particular,

- a table named **users** will contain columns `'user'`, `'use_tue_laptop'`, `'mouse_speed'`, `'mouse_accuracy'`, `'right_handed'`, `'major'`
- a table named **trials** will contain columns `'user'`, `'trial'`, `'input_method'`, `'target_x'`, `'target_y'`, `'target_radius'`, `'delay'`

These two tables will be linked via the `'user'` column.

### Exercise <span class="exercise">4.b</span>

Inspect the `df_props` data frame. You will notice that the `'mouse_speed'` and `'mouse_accuracy'` columns contain NaN  values. They are the result of a user using a non-TU/e laptop and not having to confirm these mouse settings. Replace these values in `'mouse_speed'`, `'mouse_accuracy'` by 0.

In [99]:
#// BEGIN_TODO [ORG_4b] Fill missing data (1 point)
#country_data_filled = country_data.fillna({'capital': 'Unknown'})
df_props = df_props.fillna({'mouse_speed': 0})
df_props = df_props.fillna({'mouse_accuracy': 0})

#// END_TODO [ORG_4b]

df_props.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33342 entries, 0 to 33341
Data columns (total 12 columns):
user              33342 non-null int64
trial             33342 non-null int64
use_tue_laptop    33342 non-null int64
mouse_speed       33342 non-null float64
mouse_accuracy    33342 non-null float64
right_handed      33342 non-null int64
input_method      33342 non-null int64
major             33342 non-null object
target_x          33342 non-null int64
target_y          33342 non-null int64
target_radius     33342 non-null int64
delay             33342 non-null float64
dtypes: float64(3), int64(8), object(1)
memory usage: 3.1+ MB

### Exercise <span class="exercise">4.c</span>

Convert the `'mouse_speed'`, `'mouse_accuracy'` columns to `int` type.

In [100]:
#// BEGIN_TODO [ORG_4c] Convert to integers (1 point)

df_props = df_props.astype({'mouse_accuracy': int})
df_props = df_props.astype({'mouse_speed': int})

#// END_TODO [ORG_4c]

df_props.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33342 entries, 0 to 33341
Data columns (total 12 columns):
user              33342 non-null int64
trial             33342 non-null int64
use_tue_laptop    33342 non-null int64
mouse_speed       33342 non-null int32
mouse_accuracy    33342 non-null int32
right_handed      33342 non-null int64
input_method      33342 non-null int64
major             33342 non-null object
target_x          33342 non-null int64
target_y          33342 non-null int64
target_radius     33342 non-null int64
delay             33342 non-null float64
dtypes: float64(1), int32(2), int64(8), object(1)
memory usage: 2.8+ MB

### Exercise <span class="exercise">4.d</span>

Create a data frame `df_trials` from `df_props` with the columns from the **trials** table specified above.

In [101]:
#// BEGIN_TODO [ORG_4d] Collect trials information (1 point)

# con = sqlite3.connect('df_props')  # connect to database in file

# df_props.to_sql('', con, if_exists='replace', index=False)

# query4d = 
# pd.read_sql_query(query, conn)
df_trials = df_props[['user', 'trial', 'input_method', 'target_x', 'target_y', 'target_radius', 'delay']]

#// END_TODO [ORG_4d]

df_trials.head()

   user  trial  input_method  target_x  target_y  target_radius     delay
0  1226      5             0       -84       -84              6  2.136719
1  1226      6             0         0       190              6  3.540913
2  1226      7             0      -158      -158              6  3.688381
3  1226      8             0        81       -81              3  2.823134
4  1226      9             0      -157       157              9  3.690253

### Exercise <span class="exercise">4.e</span>

Create a data frame `df_users` from `df_props` with the columns from the **users** table specified above, avoiding duplicate rows.

In [102]:
#// BEGIN_TODO [ORG_4e] Collect users information (1 point)

df_users = df_props[['user', 'use_tue_laptop', 'mouse_speed', 'mouse_accuracy', 'right_handed', 'major']].drop_duplicates()

#// END_TODO [ORG_4e]

df_users.head()

,user,use_tue_laptop,mouse_speed,mouse_accuracy,right_handed,major
0,1226,1,1,1,1,Industrial Engineering
30,1937,1,1,1,1,Industrial Engineering
60,625,1,1,1,0,Applied Physics
90,1025,1,1,1,0,Innovation Sciences
120,620,1,1,1,1,Industrial Design

### Exercise <span class="exercise">4.f</span>

Inspect the `df_users` data frame. You will notice that for some users there is more than one row. For example, some users appear to have indicated multiple computer settings. Since at this point we cannot ask those users which settings they have actually used, we will discard those users and the corresponding trials.

Identify which users have entered contradicting information, i.e. both right and left handed or using different computer settings, and assign them to a list `wrong_users`.

In [106]:
#// BEGIN_TODO [ORG_4f] Find the wrong users (1 point)

wrong_users_bool = df_users.duplicated(subset='user', keep=False)
wrong_users= df_users[wrong_users_bool]['user']

#// END_TODO [ORG_4f]

wrong_users

25905    1598
25920    1598
29006    1017
29019    1017
Name: user, dtype: int64

### Exercise <span class="exercise">4.g</span>

Discard the rows from `df_users` and `df_trials` corresponding to the users which have entered contradicting information.

In [142]:
#// BEGIN_TODO [ORG_4g] Discard the wrong users (1 point)
#country_data.drop_duplicates(subset='capital').info()
#df = df.drop(df[<some boolean condition>].index)

# df_users.drop(df_users[wrong_users].index, inplace=True)
# wrong_id= df_users[wrong_users]
# # df_trials.drop(df_trials[wrong_users].index, inplace=True)

# wrong_id

df_users = df_users[~df_users['user'].isin(wrong_users)]
df_trials = df_trials[~df_trials['user'].isin(wrong_users)]

#// END_TODO [ORG_4g]

### Exercise <span class="exercise">4.h</span>

Connect to the Fitts database `'fitts.db'`, assigning the connection to variable **`conn_fitts`** and a cursor to `cur_fitts`.

In [143]:
#// BEGIN_TODO [ORG_4h] Connect to Fitts database (1 point)

conn_fitts = sqlite3.connect('fitts.db')
cur_fitts = conn_fitts.cursor()

#// END_TODO [ORG_4h]

### Exercise <span class="exercise">4.i</span>

Use the `df_users` and `df_trials` data frames to create tables `'users'` and `'trials'` in the Fitts database.

In [144]:
#// BEGIN_TODO [ORG_4i] Create new tables (1 point)

df_users.to_sql('users', conn_fitts, if_exists='replace', index=False)
df_trials.to_sql('trials', conn_fitts, if_exists='replace', index=False)

#// END_TODO [ORG_4i]

### Exercise <span class="exercise">4.j</span>

Execute a query to count the number of trials that were performed by user 2 with a mouse.

Assign the query to variable `query_user_mouse`, and the result (an integer number) to variable `num_user_mouse`.

In [150]:
#// BEGIN_TODO [ORG_4j] Count the trials (1 point)

query_user_mouse = ''' SELECT sum(input_method) as one
FROM trials
WHERE  user LIKE 2'''

num_user_mouse = pd.read_sql_query(query_user_mouse, conn_fitts).loc[0]['one']

#// END_TODO [ORG_4j]

num_user_mouse

15

### Exercise <span class="exercise">4.k</span>

Execute a query to count the number of all trials that were performed with a trackpad.

Assign the query to variable `query_all_trackpad`, and the result (an integer number) to variable `num_all_trackpad`.

In [153]:
#// BEGIN_TODO [ORG_4k] Count the trackpad trials (1 point)

query_all_trackpad = ''' select count(input_method) as zero
from trials
where input_method = 0'''

num_all_trackpad = pd.read_sql_query(query_all_trackpad, conn_fitts).loc[0]['zero']

#// END_TODO [ORG_4k]

num_all_trackpad

16807

### Exercise <span class="exercise">4.l</span>

Execute a query to count the number of all trials that were performed by left handed people.

Assign the query to variable `query_lefthanded`, and the result (an integer number) to variable `num_lefthanded`.

In [154]:
#// BEGIN_TODO [ORG_4l] Count the lefthanded trials (1 point)

query_lefthanded = ''' select count(trials.user) as trials_count
from users, trials
where users.user = trials.user and users.right_handed = 0'''

num_lefthanded = pd.read_sql_query(query_lefthanded, conn_fitts).loc[0]['trials_count']

#// END_TODO [ORG_4l]

num_lefthanded

4346

### Exercise <span class="exercise">4.m</span>

Execute a query to compute the average delay between the start of a trial and the moment the target was shown for left handed vs. right handed people.

Assign the query to variable `query_delay`, and the result (a data frame with two rows, first row for left handed and second for right handed people, with column name `'average delay'`) to variable `result_delay`.

In [156]:
#// BEGIN_TODO [ORG_4m] Average delay (1 point)

query_delay = ''' select avg(trials.delay) as 'average delay'
from users, trials
where users.user == trials.user
group by users.right_handed'''

result_delay = pd.read_sql_query(query_delay, conn_fitts)
#// END_TODO [ORG_4m]

result_delay

   average delay
0       2.979183
1       2.996162

### Exercise <span class="exercise">4.n</span>

Let us check whether the experiment was properly conducted, in particular whether the users working with a mouse were not disadvantaged compared to those using the trackpad. Execute a query to compute the average radius of targets that were shown to users using the different input methods.

Assign the query to variable `query_radius`, and the result (a data frame with two columns `'method'` and `'average radius'`) to variable `result_radius`.

In [157]:
#// BEGIN_TODO [ORG_4n] Average radius (1 point)

query_radius = '''
select avg(target_radius) as 'average radius', input_method as method
from trials
group by input_method

'''

result_radius = pd.read_sql_query(query_radius, conn_fitts)

#// END_TODO [ORG_4n]

result_radius

   average radius  method
0        6.014994       0
1        6.000727       1

### Exercise <span class="exercise">4.o</span>

We consider the experiment to be properly conducted if the average difference in target radius between the two input methods is at most 20% of the smaller value. Was the experiment properly conducted?

Assign your boolean answer to `proper_experiment`.

In [159]:
#// BEGIN_TODO [ORG_4o] Proper experiment? (1 point)

proper_experiment = (result_radius.loc[1]['average radius']*0.2 >= result_radius.loc[0]['average radius']-result_radius.loc[1]['average radius'])

#// END_TODO [ORG_4o]

proper_experiment

True

### Exercise <span class="exercise">4.p</span>

Close the connection to the `'fitts.db'` database.

In [160]:
#// BEGIN_TODO [ORG_4p] Close the Fitts database (1 point)

conn_fitts.close()

#// END_TODO [ORG_4p]

# Feedback

Please fill in this questionaire to help us improve this course for the next year. Your feedback will be anonymized and will not affect your grade in any way!

### How many hours did you spend on these Exercises?

Assign a number to `feedback_time`.

In [164]:
#// BEGIN_TODO [Feedback_1] (0 point)

feedback_time = 5

#// END_TODO [Feedback_1] (0 point)

import numbers
assert isinstance(feedback_time, numbers.Number), "Please assign a number to feedback_time"
feedback_time

5

### How difficult did you find these Exercises?

Assign an integer to `feedback_difficulty`, on a scale 1 - 10, with 1 being very easy.

In [161]:
#// BEGIN_TODO [Feedback_2] (0 point)

feedback_difficulty = 3

#// END_TODO [Feedback_2] (0 point)

import numbers
assert isinstance(feedback_difficulty, numbers.Number), "Please assign a number to feedback_difficulty"
feedback_difficulty

3

### (Optional) What did you like?

Assign a string to `feedback_like`.

In [163]:
#// BEGIN_TODO [Feedback_3] (0 point)

feedback_like = 'this notebook was shorter and fit better in my planning'

#// END_TODO [Feedback_3] (0 point)

### (Optional) What can be improved?

Assign a string to `feedback_improve`.

In [162]:
#// BEGIN_TODO [Feedback_4] (0 point)

feedback_improve = ''

#// END_TODO [Feedback_4] (0 point)




## How to submit your work

1. **Before submitting**, you must run your notebook by doing **Kernel > Restart & Run All**.  
   Make sure that your notebook runs without errors **in linear order**.

2. Remember to rename the notebook, replacing `...-template.ipynb` with `...-yourIDnr.ipynb`, where `yourIDnr` is your TU/e identification number.

3. Submit the executed notebook with your work
   for the appropriate assignment in **Canvas**.

* In the **Momotor** tab in Canvas,
  you can select that assignment again to find some feedback on your submitted work.
  
* If there are any problems reported by _Momotor_,
  then you need to fix those,
  and **resubmit the fixed notebook**.

In case of a high workload on our server
(because many students submit close to the deadline),
it may take longer to receive the feedback.

---

In [165]:
# List all defined names
%whos

Variable              Type          Data/Info
---------------------------------------------
AUTHOR_DATE           str           2019-02-28
AUTHOR_ID_NR          str           1349171
AUTHOR_NAME           str           Kyra Moviat
area_as_int           DataFrame                              <...>n\n[251 rows x 7 columns]
bm_dup_capital        Series        0      False\n1      Fals<...>nLength: 251, dtype: bool
bm_dup_capital_all    Series        0      False\n1      Fals<...>nLength: 251, dtype: bool
conn                  Connection    <sqlite3.Connection object at 0x000001A9FF598650>
conn_fitts            Connection    <sqlite3.Connection object at 0x000001A9FF2C8F10>
continents            DataFrame                  name\nAF    <...>ceania\nSM  South America
country_data          DataFrame                              <...>n\n[251 rows x 7 columns]
country_data_as_str   DataFrame                              <...>n\n[251 rows x 7 columns]
country_data_dropna   DataFrame                              <...>n\n[243 rows x 7 columns]
country_data_filled   DataFrame                              <...>n\n[251 rows x 7 columns]
cur                   Cursor        <sqlite3.Cursor object at 0x000001A980515F80>
cur_fitts             Cursor        <sqlite3.Cursor object at 0x000001A980272E30>
curb                  Cursor        <sqlite3.Cursor object at 0x000001A9FF59F6C0>
curd                  Cursor        <sqlite3.Cursor object at 0x000001A980272500>
df_props              DataFrame            user  trial  use_t<...>[33342 rows x 12 columns]
df_trials             DataFrame            user  trial  input<...>n[33312 rows x 7 columns]
df_users              DataFrame            user  use_tue_lapt<...>\n[1183 rows x 6 columns]
dropped_dup_tld       DataFrame                              <...>n\n[248 rows x 7 columns]
dropped_na_tld        DataFrame                              <...>n\n[249 rows x 7 columns]
duplicate_tld         Series        0      False\n1      Fals<...>nLength: 251, dtype: bool
feedback_difficulty   int           3
feedback_improve      str
feedback_like         str           this notebook was shorter<...>fit better in my planning
feedback_time         int           5
filled_tld            DataFrame                              <...>n\n[251 rows x 7 columns]
get_pop_NL            str           SELECT name, population F<...>ERE name = "Netherlands";
np                    module        <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
num_all_trackpad      int64         16807
num_lefthanded        int64         4346
num_user_mouse        int64         15
numbers               module        <module 'numbers' from 'C<...>conda3\\lib\\numbers.py'>
pd                    module        <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
population_as_str     DataFrame                              <...>n\n[251 rows x 7 columns]
proper_experiment     bool_         True
query                 str           \n    SELECT countries.na<...>ion DESC\n    LIMIT 10;\n
query1a               str            \nSELECT name, area, pop<...>s\nWHERE area > 1000000\n
query1b               str           \nSELECT name, population<...>DER BY population DESC;\n
query1c               str           \nUPDATE countries\nSET p<...>RE name = "Antarctica";\n
query_2a              str           \nSELECT name, capital, p<...>00\nORDER BY area DESC;\n
query_2b              str           \nSELECT continents.name <...>ex"\nGROUP BY continent\n
query_2c              str           SELECT continent\nFROM co<...>RE population > 100000000
query_2d              str           UPDATE countries\nSET pop<...>WHERE name LIKE "%land"\n
query_2e              str           SELECT name, population\n<...>\nWHERE name LIKE "%land"
query_D               str           SELECT continent\nFROM co<...>ies\nWHERE name LIKE "%D"
query_E               str           \n    SELECT continent\n <...>   WHERE name LIKE "E%"\n
query_E_except_L      str           \n    SELECT continent\n <...>  WHERE area > 10000000\n
query_L               str           \n    SELECT continent\n <...>  WHERE area > 10000000\n
query_M               str           SELECT continent\nFROM co<...>RE population > 100000000
query_all__trackpad   str            select count(input_metho<...>s\nwhere input_method = 0
query_all_trackpad    str            select count(input_metho<...>s\nwhere input_method = 0
query_delay           str            select avg(trials.delay)<...>oup by users.right_handed
query_lefthanded      str            select count(trials.user<...>nd users.right_handed = 0
query_radius          str           \nselect avg(target_radiu<...>group by input_method\n\n
query_user_mouse      str            SELECT sum(input_method)<...>rials\nWHERE  user LIKE 2
result                DataFrame        COUNT(trial)\n0             0
result_1a             DataFrame                              <...>a   1219912.0    49000000
result_1b             list          n=5
result_2a             DataFrame     Empty DataFrame\nColumns:<...>ulation, area]\nIndex: []
result_2b             DataFrame       continent name  total p<...>America         400143568
result_2c             DataFrame       continent\n0        AN\n1        OC
result_2e             DataFrame                     name  pop<...>     Thailand           0
result_2g             DataFrame                     name  pop<...>     Thailand    67089500
result_delay          DataFrame        average delay\n0      <...>.979183\n1       2.996162
result_radius         DataFrame        average radius  method<...>1        6.000727       1
resultt               DataFrame        count(input_method)\n0                16807
sqlite3               module        <module 'sqlite3' from 'C<...>b\\sqlite3\\__init__.py'>
stripped_names        Series        0                        <...>ength: 251, dtype: object
unique_continents     ndarray       7: 7 elems, type `object`, 56 bytes
update_pop_NL         str           \n    UPDATE countries\n <...>E name = "Netherlands";\n
wrong_users           Series        0        False\n30       <...>Length: 1184, dtype: bool

---

# (End of Notebook) 

&copy; 2017-2019 - **TU/e** - Eindhoven University of Technology